Revit 2024 API
TrussMemberInfo Constructor
For Internal Use Only.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public TrussMemberInfo()
Visual Basic
Public Sub New
Visual C++
public:
TrussMemberInfo()
Remarks
This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.
See Also
TrussMemberInfo Class
Autodesk.Revit.DB.Structure Namespace